HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxEray_regdef.h
/** \\brief  Message Buffer Status Changed Interrupt Control 2 */
typedef struct _Ifx_ERAY_MSIC2_Bits
{
    unsigned int MSIP32:1;                  /**< \brief [0:0] Message Buffer Status Changed Interrupt Pointer 32 (32 = 32-63) (rh) */
    unsigned int MSIP33:1;                  /**< \brief [1:1] Message Buffer Status Changed Interrupt Pointer 33 (33 = 32-63) (rh) */
    unsigned int MSIP34:1;                  /**< \brief [2:2] Message Buffer Status Changed Interrupt Pointer 34 (34 = 32-63) (rh) */
    unsigned int MSIP35:1;                  /**< \brief [3:3] Message Buffer Status Changed Interrupt Pointer 35 (35 = 32-63) (rh) */
    unsigned int MSIP36:1;                  /**< \brief [4:4] Message Buffer Status Changed Interrupt Pointer 36 (36 = 32-63) (rh) */
    unsigned int MSIP37:1;                  /**< \brief [5:5] Message Buffer Status Changed Interrupt Pointer 37 (37 = 32-63) (rh) */
    unsigned int MSIP38:1;                  /**< \brief [6:6] Message Buffer Status Changed Interrupt Pointer 38 (38 = 32-63) (rh) */
    unsigned int MSIP39:1;                  /**< \brief [7:7] Message Buffer Status Changed Interrupt Pointer 39 (39 = 32-63) (rh) */
    unsigned int MSIP40:1;                  /**< \brief [8:8] Message Buffer Status Changed Interrupt Pointer 40 (40 = 32-63) (rh) */
    unsigned int MSIP41:1;                  /**< \brief [9:9] Message Buffer Status Changed Interrupt Pointer 41 (41 = 32-63) (rh) */
    unsigned int MSIP42:1;                  /**< \brief [10:10] Message Buffer Status Changed Interrupt Pointer 42 (42 = 32-63) (rh) */
    unsigned int MSIP43:1;                  /**< \brief [11:11] Message Buffer Status Changed Interrupt Pointer 43 (43 = 32-63) (rh) */
    unsigned int MSIP44:1;                  /**< \brief [12:12] Message Buffer Status Changed Interrupt Pointer 44 (44 = 32-63) (rh) */
    unsigned int MSIP45:1;                  /**< \brief [13:13] Message Buffer Status Changed Interrupt Pointer 45 (45 = 32-63) (rh) */
    unsigned int MSIP46:1;                  /**< \brief [14:14] Message Buffer Status Changed Interrupt Pointer 46 (46 = 32-63) (rh) */
    unsigned int MSIP47:1;                  /**< \brief [15:15] Message Buffer Status Changed Interrupt Pointer 47 (47 = 32-63) (rh) */
    unsigned int MSIP48:1;                  /**< \brief [16:16] Message Buffer Status Changed Interrupt Pointer 48 (48 = 32-63) (rh) */
    unsigned int MSIP49:1;                  /**< \brief [17:17] Message Buffer Status Changed Interrupt Pointer 49 (49 = 32-63) (rh) */
    unsigned int MSIP50:1;                  /**< \brief [18:18] Message Buffer Status Changed Interrupt Pointer 50 (50 = 32-63) (rh) */
    unsigned int MSIP51:1;                  /**< \brief [19:19] Message Buffer Status Changed Interrupt Pointer 51 (51 = 32-63) (rh) */
    unsigned int MSIP52:1;                  /**< \brief [20:20] Message Buffer Status Changed Interrupt Pointer 52 (52 = 32-63) (rh) */
    unsigned int MSIP53:1;                  /**< \brief [21:21] Message Buffer Status Changed Interrupt Pointer 53 (53 = 32-63) (rh) */
    unsigned int MSIP54:1;                  /**< \brief [22:22] Message Buffer Status Changed Interrupt Pointer 54 (54 = 32-63) (rh) */
    unsigned int MSIP55:1;                  /**< \brief [23:23] Message Buffer Status Changed Interrupt Pointer 55 (55 = 32-63) (rh) */
    unsigned int MSIP56:1;                  /**< \brief [24:24] Message Buffer Status Changed Interrupt Pointer 56 (56 = 32-63) (rh) */
    unsigned int MSIP57:1;                  /**< \brief [25:25] Message Buffer Status Changed Interrupt Pointer 57 (57 = 32-63) (rh) */
    unsigned int MSIP58:1;                  /**< \brief [26:26] Message Buffer Status Changed Interrupt Pointer 58 (58 = 32-63) (rh) */
    unsigned int MSIP59:1;                  /**< \brief [27:27] Message Buffer Status Changed Interrupt Pointer 59 (59 = 32-63) (rh) */
    unsigned int MSIP60:1;                  /**< \brief [28:28] Message Buffer Status Changed Interrupt Pointer 60 (60 = 32-63) (rh) */
    unsigned int MSIP61:1;                  /**< \brief [29:29] Message Buffer Status Changed Interrupt Pointer 61 (61 = 32-63) (rh) */
    unsigned int MSIP62:1;                  /**< \brief [30:30] Message Buffer Status Changed Interrupt Pointer 62 (62 = 32-63) (rh) */
    unsigned int MSIP63:1;                  /**< \brief [31:31] Message Buffer Status Changed Interrupt Pointer 63 (63 = 32-63) (rh) */
} Ifx_ERAY_MSIC2_Bits;

/** \\brief  Message Buffer Status Changed Interrupt Control 3 */
typedef struct _Ifx_ERAY_MSIC3_Bits
{
    unsigned int MSIP64:1;                  /**< \brief [0:0] Message Buffer Status Changed Interrupt Pointer 64 (64 = 64-95) (rw) */
    unsigned int MSIP65:1;                  /**< \brief [1:1] Message Buffer Status Changed Interrupt Pointer 65 (65 = 64-95) (rw) */
    unsigned int MSIP66:1;                  /**< \brief [2:2] Message Buffer Status Changed Interrupt Pointer 66 (66 = 64-95) (rw) */
    unsigned int MSIP67:1;                  /**< \brief [3:3] Message Buffer Status Changed Interrupt Pointer 67 (67 = 64-95) (rw) */
    unsigned int MSIP68:1;                  /**< \brief [4:4] Message Buffer Status Changed Interrupt Pointer 68 (68 = 64-95) (rw) */
    unsigned int MSIP69:1;                  /**< \brief [5:5] Message Buffer Status Changed Interrupt Pointer 69 (69 = 64-95) (rw) */
    unsigned int MSIP70:1;                  /**< \brief [6:6] Message Buffer Status Changed Interrupt Pointer 70 (70 = 64-95) (rw) */
    unsigned int MSIP71:1;                  /**< \brief [7:7] Message Buffer Status Changed Interrupt Pointer 71 (71 = 64-95) (rw) */
    unsigned int MSIP72:1;                  /**< \brief [8:8] Message Buffer Status Changed Interrupt Pointer 72 (72 = 64-95) (rw) */
    unsigned int MSIP73:1;                  /**< \brief [9:9] Message Buffer Status Changed Interrupt Pointer 73 (73 = 64-95) (rw) */
    unsigned int MSIP74:1;                  /**< \brief [10:10] Message Buffer Status Changed Interrupt Pointer 74 (74 = 64-95) (rw) */
    unsigned int MSIP75:1;                  /**< \brief [11:11] Message Buffer Status Changed Interrupt Pointer 75 (75 = 64-95) (rw) */
    unsigned int MSIP76:1;                  /**< \brief [12:12] Message Buffer Status Changed Interrupt Pointer 76 (76 = 64-95) (rw) */
    unsigned int MSIP77:1;                  /**< \brief [13:13] Message Buffer Status Changed Interrupt Pointer 77 (77 = 64-95) (rw) */
    unsigned int MSIP78:1;                  /**< \brief [14:14] Message Buffer Status Changed Interrupt Pointer 78 (78 = 64-95) (rw) */
    unsigned int MSIP79:1;                  /**< \brief [15:15] Message Buffer Status Changed Interrupt Pointer 79 (79 = 64-95) (rw) */
    unsigned int MSIP80:1;                  /**< \brief [16:16] Message Buffer Status Changed Interrupt Pointer 80 (80 = 64-95) (rw) */
    unsigned int MSIP81:1;                  /**< \brief [17:17] Message Buffer Status Changed Interrupt Pointer 81 (81 = 64-95) (rw) */
    unsigned int MSIP82:1;                  /**< \brief [18:18] Message Buffer Status Changed Interrupt Pointer 82 (82 = 64-95) (rw) */
    unsigned int MSIP83:1;                  /**< \brief [19:19] Message Buffer Status Changed Interrupt Pointer 83 (83 = 64-95) (rw) */
    unsigned int MSIP84:1;                  /**< \brief [20:20] Message Buffer Status Changed Interrupt Pointer 84 (84 = 64-95) (rw) */
    unsigned int MSIP85:1;                  /**< \brief [21:21] Message Buffer Status Changed Interrupt Pointer 85 (85 = 64-95) (rw) */
    unsigned int MSIP86:1;                  /**< \brief [22:22] Message Buffer Status Changed Interrupt Pointer 86 (86 = 64-95) (rw) */
    unsigned int MSIP87:1;                  /**< \brief [23:23] Message Buffer Status Changed Interrupt Pointer 87 (87 = 64-95) (rw) */
    unsigned int MSIP88:1;                  /**< \brief [24:24] Message Buffer Status Changed Interrupt Pointer 88 (88 = 64-95) (rw) */
    unsigned int MSIP89:1;                  /**< \brief [25:25] Message Buffer Status Changed Interrupt Pointer 89 (89 = 64-95) (rw) */
    unsigned int MSIP90:1;                  /**< \brief [26:26] Message Buffer Status Changed Interrupt Pointer 90 (90 = 64-95) (rw) */
    unsigned int MSIP91:1;                  /**< \brief [27:27] Message Buffer Status Changed Interrupt Pointer 91 (91 = 64-95) (rw) */
    unsigned int MSIP92:1;                  /**< \brief [28:28] Message Buffer Status Changed Interrupt Pointer 92 (92 = 64-95) (rw) */
    unsigned int MSIP93:1;                  /**< \brief [29:29] Message Buffer Status Changed Interrupt Pointer 93 (93 = 64-95) (rw) */
    unsigned int MSIP94:1;                  /**< \brief [30:30] Message Buffer Status Changed Interrupt Pointer 94 (94 = 64-95) (rw) */
    unsigned int MSIP95:1;                  /**< \brief [31:31] Message Buffer Status Changed Interrupt Pointer 95 (95 = 64-95) (rw) */
} Ifx_ERAY_MSIC3_Bits;

