HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxEray_regdef.h
/** \\brief  New Data Register 2 */
typedef struct _Ifx_ERAY_NDAT2_Bits
{
    unsigned int ND32:1;                    /**< \brief [0:0] New Data 32 (32 = 32-63) (rh) */
    unsigned int ND33:1;                    /**< \brief [1:1] New Data 33 (33 = 32-63) (rh) */
    unsigned int ND34:1;                    /**< \brief [2:2] New Data 34 (34 = 32-63) (rh) */
    unsigned int ND35:1;                    /**< \brief [3:3] New Data 35 (35 = 32-63) (rh) */
    unsigned int ND36:1;                    /**< \brief [4:4] New Data 36 (36 = 32-63) (rh) */
    unsigned int ND37:1;                    /**< \brief [5:5] New Data 37 (37 = 32-63) (rh) */
    unsigned int ND38:1;                    /**< \brief [6:6] New Data 38 (38 = 32-63) (rh) */
    unsigned int ND39:1;                    /**< \brief [7:7] New Data 39 (39 = 32-63) (rh) */
    unsigned int ND40:1;                    /**< \brief [8:8] New Data 40 (40 = 32-63) (rh) */
    unsigned int ND41:1;                    /**< \brief [9:9] New Data 41 (41 = 32-63) (rh) */
    unsigned int ND42:1;                    /**< \brief [10:10] New Data 42 (42 = 32-63) (rh) */
    unsigned int ND43:1;                    /**< \brief [11:11] New Data 43 (43 = 32-63) (rh) */
    unsigned int ND44:1;                    /**< \brief [12:12] New Data 44 (44 = 32-63) (rh) */
    unsigned int ND45:1;                    /**< \brief [13:13] New Data 45 (45 = 32-63) (rh) */
    unsigned int ND46:1;                    /**< \brief [14:14] New Data 46 (46 = 32-63) (rh) */
    unsigned int ND47:1;                    /**< \brief [15:15] New Data 47 (47 = 32-63) (rh) */
    unsigned int ND48:1;                    /**< \brief [16:16] New Data 48 (48 = 32-63) (rh) */
    unsigned int ND49:1;                    /**< \brief [17:17] New Data 49 (49 = 32-63) (rh) */
    unsigned int ND50:1;                    /**< \brief [18:18] New Data 50 (50 = 32-63) (rh) */
    unsigned int ND51:1;                    /**< \brief [19:19] New Data 51 (51 = 32-63) (rh) */
    unsigned int ND52:1;                    /**< \brief [20:20] New Data 52 (52 = 32-63) (rh) */
    unsigned int ND53:1;                    /**< \brief [21:21] New Data 53 (53 = 32-63) (rh) */
    unsigned int ND54:1;                    /**< \brief [22:22] New Data 54 (54 = 32-63) (rh) */
    unsigned int ND55:1;                    /**< \brief [23:23] New Data 55 (55 = 32-63) (rh) */
    unsigned int ND56:1;                    /**< \brief [24:24] New Data 56 (56 = 32-63) (rh) */
    unsigned int ND57:1;                    /**< \brief [25:25] New Data 57 (57 = 32-63) (rh) */
    unsigned int ND58:1;                    /**< \brief [26:26] New Data 58 (58 = 32-63) (rh) */
    unsigned int ND59:1;                    /**< \brief [27:27] New Data 59 (59 = 32-63) (rh) */
    unsigned int ND60:1;                    /**< \brief [28:28] New Data 60 (60 = 32-63) (rh) */
    unsigned int ND61:1;                    /**< \brief [29:29] New Data 61 (61 = 32-63) (rh) */
    unsigned int ND62:1;                    /**< \brief [30:30] New Data 62 (62 = 32-63) (rh) */
    unsigned int ND63:1;                    /**< \brief [31:31] New Data 63 (63 = 32-63) (rh) */
} Ifx_ERAY_NDAT2_Bits;

/** \\brief  New Data Register 3 */
typedef struct _Ifx_ERAY_NDAT3_Bits
{
    unsigned int ND64:1;                    /**< \brief [0:0] New Data 64 (64 = 64-95) (rh) */
    unsigned int ND65:1;                    /**< \brief [1:1] New Data 65 (65 = 64-95) (rh) */
    unsigned int ND66:1;                    /**< \brief [2:2] New Data 66 (66 = 64-95) (rh) */
    unsigned int ND67:1;                    /**< \brief [3:3] New Data 67 (67 = 64-95) (rh) */
    unsigned int ND68:1;                    /**< \brief [4:4] New Data 68 (68 = 64-95) (rh) */
    unsigned int ND69:1;                    /**< \brief [5:5] New Data 69 (69 = 64-95) (rh) */
    unsigned int ND70:1;                    /**< \brief [6:6] New Data 70 (70 = 64-95) (rh) */
    unsigned int ND71:1;                    /**< \brief [7:7] New Data 71 (71 = 64-95) (rh) */
    unsigned int ND72:1;                    /**< \brief [8:8] New Data 72 (72 = 64-95) (rh) */
    unsigned int ND73:1;                    /**< \brief [9:9] New Data 73 (73 = 64-95) (rh) */
    unsigned int ND74:1;                    /**< \brief [10:10] New Data 74 (74 = 64-95) (rh) */
    unsigned int ND75:1;                    /**< \brief [11:11] New Data 75 (75 = 64-95) (rh) */
    unsigned int ND76:1;                    /**< \brief [12:12] New Data 76 (76 = 64-95) (rh) */
    unsigned int ND77:1;                    /**< \brief [13:13] New Data 77 (77 = 64-95) (rh) */
    unsigned int ND78:1;                    /**< \brief [14:14] New Data 78 (78 = 64-95) (rh) */
    unsigned int ND79:1;                    /**< \brief [15:15] New Data 79 (79 = 64-95) (rh) */
    unsigned int ND80:1;                    /**< \brief [16:16] New Data 80 (80 = 64-95) (rh) */
    unsigned int ND81:1;                    /**< \brief [17:17] New Data 81 (81 = 64-95) (rh) */
    unsigned int ND82:1;                    /**< \brief [18:18] New Data 82 (82 = 64-95) (rh) */
    unsigned int ND83:1;                    /**< \brief [19:19] New Data 83 (83 = 64-95) (rh) */
    unsigned int ND84:1;                    /**< \brief [20:20] New Data 84 (84 = 64-95) (rh) */
    unsigned int ND85:1;                    /**< \brief [21:21] New Data 85 (85 = 64-95) (rh) */
    unsigned int ND86:1;                    /**< \brief [22:22] New Data 86 (86 = 64-95) (rh) */
    unsigned int ND87:1;                    /**< \brief [23:23] New Data 87 (87 = 64-95) (rh) */
    unsigned int ND88:1;                    /**< \brief [24:24] New Data 88 (88 = 64-95) (rh) */
    unsigned int ND89:1;                    /**< \brief [25:25] New Data 89 (89 = 64-95) (rh) */
    unsigned int ND90:1;                    /**< \brief [26:26] New Data 90 (90 = 64-95) (rh) */
    unsigned int ND91:1;                    /**< \brief [27:27] New Data 91 (91 = 64-95) (rh) */
    unsigned int ND92:1;                    /**< \brief [28:28] New Data 92 (92 = 64-95) (rh) */
    unsigned int ND93:1;                    /**< \brief [29:29] New Data 93 (93 = 64-95) (rh) */
    unsigned int ND94:1;                    /**< \brief [30:30] New Data 94 (94 = 64-95) (rh) */
    unsigned int ND95:1;                    /**< \brief [31:31] New Data 95 (95 = 64-95) (rh) */
} Ifx_ERAY_NDAT3_Bits;

