HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxEray_regdef.h
/** \\brief  Status Service Request Register */
typedef struct _Ifx_ERAY_SIR_Bits
{
    unsigned int WST:1;                     /**< \brief [0:0] Wakeup Status (rwh) */
    unsigned int CAS:1;                     /**< \brief [1:1] Collision Avoidance Symbol (rwh) */
    unsigned int CYCS:1;                    /**< \brief [2:2] Cycle Start Service Request (rwh) */
    unsigned int TXI:1;                     /**< \brief [3:3] Transmit Service Request (rwh) */
    unsigned int RXI:1;                     /**< \brief [4:4] Receive Service Request (rwh) */
    unsigned int RFNE:1;                    /**< \brief [5:5] Receive FIFO Not Empty (rh) */
    unsigned int RFCL:1;                    /**< \brief [6:6] Receive FIFO Critical Level (rh) */
    unsigned int NMVC:1;                    /**< \brief [7:7] Network Management Vector Changed (rwh) */
    unsigned int TI0:1;                     /**< \brief [8:8] Timer Service Request 0 (rwh) */
    unsigned int TI1:1;                     /**< \brief [9:9] Timer Service Request 1 (rwh) */
    unsigned int TIBC:1;                    /**< \brief [10:10] Transfer Input Buffer Completed (rwh) */
    unsigned int TOBC:1;                    /**< \brief [11:11] Transfer Output Buffer Completed (rwh) */
    unsigned int SWE:1;                     /**< \brief [12:12] Stop Watch Event (rwh) */
    unsigned int SUCS:1;                    /**< \brief [13:13] Startup Completed Successfully (rwh) */
    unsigned int MBSI:1;                    /**< \brief [14:14] Message Buffer Status Service Request (rwh) */
    unsigned int SDS:1;                     /**< \brief [15:15] Start of Dynamic Segment (rwh) */
    unsigned int WUPA:1;                    /**< \brief [16:16] Wakeup Pattern Channel A (rwh) */
    unsigned int MTSA:1;                    /**< \brief [17:17] MTS Received on Channel A (vSS!ValidMTSA) (rwh) */
    unsigned int reserved_18:6;             /**< \brief \internal Reserved */
    unsigned int WUPB:1;                    /**< \brief [24:24] Wakeup Pattern Channel B (rwh) */
    unsigned int MTSB:1;                    /**< \brief [25:25] MTS Received on Channel B (vSS!ValidMTSB) (rwh) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_ERAY_SIR_Bits;

/** \\brief  Stop Watch Register 1 */
typedef struct _Ifx_ERAY_STPW1_Bits
{
    unsigned int ESWT:1;                    /**< \brief [0:0] Enable Stop Watch Trigger (rwh) */
    unsigned int SWMS:1;                    /**< \brief [1:1] Stop Watch Mode Select (rw) */
    unsigned int EDGE:1;                    /**< \brief [2:2] Stop Watch Trigger Edge Select (rw) */
    unsigned int SSWT:1;                    /**< \brief [3:3] Software Stop Watch Trigger (rwh) */
    unsigned int EETP:1;                    /**< \brief [4:4] Enable External Trigger Pin (rw) */
    unsigned int EINT0:1;                   /**< \brief [5:5] Enable Service Request 0 Trigger (rw) */
    unsigned int EINT1:1;                   /**< \brief [6:6] Enable Service Request 1 Trigger (rw) */
    unsigned int reserved_7:1;              /**< \brief \internal Reserved */
    unsigned int SCCV:6;                    /**< \brief [13:8] Stopped Cycle Counter Value (rh) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int SMTV:14;                   /**< \brief [29:16] Stopped Macrotick Value (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_ERAY_STPW1_Bits;

/** \\brief  Stop Watch Register 2 */
typedef struct _Ifx_ERAY_STPW2_Bits
{
    unsigned int SSCVA:11;                  /**< \brief [10:0] Stop Watch Captured Slot Counter Value Channel A (rh) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int SSCVB:11;                  /**< \brief [26:16] Stop Watch Captured Slot Counter Value Channel B (rh) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_ERAY_STPW2_Bits;

/** \\brief  SUC Configuration Register 1 */
typedef struct _Ifx_ERAY_SUCC1_Bits
{
    unsigned int CMD:4;                     /**< \brief [3:0] CHI Command Vector (rwh) */
    unsigned int reserved_4:3;              /**< \brief \internal Reserved */
    unsigned int PBSY:1;                    /**< \brief [7:7] POC Busy (rh) */
    unsigned int TXST:1;                    /**< \brief [8:8] Transmit Startup Frame in Key Slot (pKeySlotUsedForStartup) (rw) */
    unsigned int TXSY:1;                    /**< \brief [9:9] Transmit SYNC Frame in Key Slot(pKeySlotUsedForSync) (rw) */
    unsigned int reserved_10:1;             /**< \brief \internal Reserved */
    unsigned int CSA:5;                     /**< \brief [15:11] Cold Start Attempts(gColdStartAttempts) (rw) */
    unsigned int PTA:5;                     /**< \brief [20:16] Passive to Active (pAllowPassiveToActive) (rw) */
    unsigned int WUCS:1;                    /**< \brief [21:21] Wakeup Channel Select (pWakeupChannel) (rw) */
    unsigned int TSM:1;                     /**< \brief [22:22] Transmission Slot Mode (pSingleSlotEnabled) (rw) */
    unsigned int HCSE:1;                    /**< \brief [23:23] Halt due to Clock Sync Error (pAllowHaltDueToClock) (rw) */
    unsigned int MTSA:1;                    /**< \brief [24:24] Select Channel A for MTS Transmission (rw) */
    unsigned int MTSB:1;                    /**< \brief [25:25] Select Channel B for MTS Transmission (rw) */
    unsigned int CCHA:1;                    /**< \brief [26:26] Connected to Channel A (pChannels) (rw) */
    unsigned int CCHB:1;                    /**< \brief [27:27] Connected to Channel B (pChannels) (rw) */
    unsigned int reserved_28:4;             /**< \brief \internal Reserved */
} Ifx_ERAY_SUCC1_Bits;

/** \\brief  SUC Configuration Register 2 */
typedef struct _Ifx_ERAY_SUCC2_Bits
{
    unsigned int LT:21;                     /**< \brief [20:0] Listen Timeout (pdListenTimeout) (rw) */
    unsigned int reserved_21:3;             /**< \brief \internal Reserved */
    unsigned int LTN:4;                     /**< \brief [27:24] Listen Time-out Noise (gListenNoise - 1) (rw) */
    unsigned int reserved_28:4;             /**< \brief \internal Reserved */
} Ifx_ERAY_SUCC2_Bits;

/** \\brief  SUC Configuration Register 3 */
typedef struct _Ifx_ERAY_SUCC3_Bits
{
    unsigned int WCP:4;                     /**< \brief [3:0] Maximum Without Clock Correction Passive (gMaxWithoutClockCorrectionPassive) (rw) */
    unsigned int WCF:4;                     /**< \brief [7:4] Maximum Without Clock Correction Fatal (gMaxWithoutClockCorrecti on Fatal) (rw) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_ERAY_SUCC3_Bits;

