HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxEray_regdef.h
/** \\brief  Transmission Request Register 4 */
typedef struct _Ifx_ERAY_TXRQ4_Bits
{
    unsigned int TXR96:1;                   /**< \brief [0:0] Transmission Request 96 (96 = 96-127) (rh) */
    unsigned int TXR97:1;                   /**< \brief [1:1] Transmission Request 97 (97 = 96-127) (rh) */
    unsigned int TXR98:1;                   /**< \brief [2:2] Transmission Request 98 (98 = 96-127) (rh) */
    unsigned int TXR99:1;                   /**< \brief [3:3] Transmission Request 99 (99 = 96-127) (rh) */
    unsigned int TXR100:1;                  /**< \brief [4:4] Transmission Request 100 (100 = 96-127) (rh) */
    unsigned int TXR101:1;                  /**< \brief [5:5] Transmission Request 101 (101 = 96-127) (rh) */
    unsigned int TXR102:1;                  /**< \brief [6:6] Transmission Request 102 (102 = 96-127) (rh) */
    unsigned int TXR103:1;                  /**< \brief [7:7] Transmission Request 103 (103 = 96-127) (rh) */
    unsigned int TXR104:1;                  /**< \brief [8:8] Transmission Request 104 (104 = 96-127) (rh) */
    unsigned int TXR105:1;                  /**< \brief [9:9] Transmission Request 105 (105 = 96-127) (rh) */
    unsigned int TXR106:1;                  /**< \brief [10:10] Transmission Request 106 (106 = 96-127) (rh) */
    unsigned int TXR107:1;                  /**< \brief [11:11] Transmission Request 107 (107 = 96-127) (rh) */
    unsigned int TXR108:1;                  /**< \brief [12:12] Transmission Request 108 (108 = 96-127) (rh) */
    unsigned int TXR109:1;                  /**< \brief [13:13] Transmission Request 109 (109 = 96-127) (rh) */
    unsigned int TXR110:1;                  /**< \brief [14:14] Transmission Request 110 (110 = 96-127) (rh) */
    unsigned int TXR111:1;                  /**< \brief [15:15] Transmission Request 111 (111 = 96-127) (rh) */
    unsigned int TXR112:1;                  /**< \brief [16:16] Transmission Request 112 (112 = 96-127) (rh) */
    unsigned int TXR113:1;                  /**< \brief [17:17] Transmission Request 113 (113 = 96-127) (rh) */
    unsigned int TXR114:1;                  /**< \brief [18:18] Transmission Request 114 (114 = 96-127) (rh) */
    unsigned int TXR115:1;                  /**< \brief [19:19] Transmission Request 115 (115 = 96-127) (rh) */
    unsigned int TXR116:1;                  /**< \brief [20:20] Transmission Request 116 (116 = 96-127) (rh) */
    unsigned int TXR117:1;                  /**< \brief [21:21] Transmission Request 117 (117 = 96-127) (rh) */
    unsigned int TXR118:1;                  /**< \brief [22:22] Transmission Request 118 (118 = 96-127) (rh) */
    unsigned int TXR119:1;                  /**< \brief [23:23] Transmission Request 119 (119 = 96-127) (rh) */
    unsigned int TXR120:1;                  /**< \brief [24:24] Transmission Request 120 (120 = 96-127) (rh) */
    unsigned int TXR121:1;                  /**< \brief [25:25] Transmission Request 121 (121 = 96-127) (rh) */
    unsigned int TXR122:1;                  /**< \brief [26:26] Transmission Request 122 (122 = 96-127) (rh) */
    unsigned int TXR123:1;                  /**< \brief [27:27] Transmission Request 123 (123 = 96-127) (rh) */
    unsigned int TXR124:1;                  /**< \brief [28:28] Transmission Request 124 (124 = 96-127) (rh) */
    unsigned int TXR125:1;                  /**< \brief [29:29] Transmission Request 125 (125 = 96-127) (rh) */
    unsigned int TXR126:1;                  /**< \brief [30:30] Transmission Request 126 (126 = 96-127) (rh) */
    unsigned int TXR127:1;                  /**< \brief [31:31] Transmission Request 127 (127 = 96-127) (rh) */
} Ifx_ERAY_TXRQ4_Bits;

/** \\brief  Write Data Section */
typedef struct _Ifx_ERAY_WRDS_Bits
{
    unsigned int MDWB0:8;                   /**< \brief [7:0] 32-Bit Word nn, Byte 0 (rw) */
    unsigned int MDWB1:8;                   /**< \brief [15:8] 32-Bit Word nn, Byte 1 (rw) */
    unsigned int MDWB2:8;                   /**< \brief [23:16] 32-Bit Word nn, Byte 2 (rw) */
    unsigned int MDWB3:8;                   /**< \brief [31:24] 32-Bit Word nn, Byte 3 (rw) */
} Ifx_ERAY_WRDS_Bits;

/** \\brief  Write Header Section 1 */
typedef struct _Ifx_ERAY_WRHS1_Bits
{
    unsigned int FID:11;                    /**< \brief [10:0] Frame ID (rw) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int CYC:7;                     /**< \brief [22:16] Cycle Code (rw) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int CHA:1;                     /**< \brief [24:24] Channel Filter Control A (rw) */
    unsigned int CHB:1;                     /**< \brief [25:25] Channel Filter Control B (rw) */
    unsigned int CFG:1;                     /**< \brief [26:26] Message Buffer Direction Configuration Bit (rw) */
    unsigned int PPIT:1;                    /**< \brief [27:27] Payload Preamble Indicator Transmit (rw) */
    unsigned int TXM:1;                     /**< \brief [28:28] Transmission Mode (rw) */
    unsigned int MBI:1;                     /**< \brief [29:29] Message Buffer Service Request (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_ERAY_WRHS1_Bits;

/** \\brief  Write Header Section 2 */
typedef struct _Ifx_ERAY_WRHS2_Bits
{
    unsigned int CRC:11;                    /**< \brief [10:0] Header CRC (vRF!Header!HeaderCRC) (rw) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int PLC:7;                     /**< \brief [22:16] Payload Length Configured (rw) */
    unsigned int reserved_23:9;             /**< \brief \internal Reserved */
} Ifx_ERAY_WRHS2_Bits;

/** \\brief  Write Header Section 3 */
typedef struct _Ifx_ERAY_WRHS3_Bits
{
    unsigned int DP:11;                     /**< \brief [10:0] Data Pointer (rw) */
    unsigned int reserved_11:21;            /**< \brief \internal Reserved */
} Ifx_ERAY_WRHS3_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Eray_union
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_ACCEN0_Bits B;
} Ifx_ERAY_ACCEN0;

/** \\brief  Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_ACCEN1_Bits B;
} Ifx_ERAY_ACCEN1;

